### 1. Use a python module containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [23]:
from pydataset import data
import pandas as pd

In [2]:
iris = data('iris')

- #### print the first 3 rows

In [4]:
iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

- #### print the number of rows and columns (shape)

In [9]:
iris.shape

(150, 5)

- #### print the column names

In [10]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
Sepal.Length    150 non-null float64
Sepal.Width     150 non-null float64
Petal.Length    150 non-null float64
Petal.Width     150 non-null float64
Species         150 non-null object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

- #### print the data type of each column

In [12]:
iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

- #### print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

I would NOT recommend rescaling the data based on these statistics.

In [11]:
iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

### 2. Read Table1_CustDetails the excel module dataset, Excel_Exercises.xlsx, into a dataframe, df_excel

In [25]:
customer_df = pd.read_excel('Excel_Exercises.xlsx', sheet_name=0)

- #### assign the first 100 rows to a new dataframe, df_excel_sample

In [27]:
df_excel_sample = customer_df.head(100)

- #### print the number of rows of your original dataframe

In [30]:
customer_df.shape[0]

7049

- #### print the first 5 column names

In [39]:
df_excel_sample.columns[:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

- #### print the column names that have a data type of object

In [43]:
df_excel_sample.dtypes

customer_id           object
gender                object
is_senior_citizen      int64
partner               object
dependents            object
phone_service          int64
internet_service       int64
contract_type          int64
payment_type          object
monthly_charges      float64
total_charges        float64
churn                 object
dtype: object

In [48]:
df_excel_sample.dtypes[df_excel_sample.dtypes == 'object']

customer_id     object
gender          object
partner         object
dependents      object
payment_type    object
churn           object
dtype: object

- #### compute the range for each of the numeric variables.

In [59]:
[df_excel_sample.dtypes == 'int64'] or [df_excel_sample.dtypes == 'float64']

[customer_id          False
 gender               False
 is_senior_citizen     True
 partner              False
 dependents           False
 phone_service         True
 internet_service      True
 contract_type         True
 payment_type         False
 monthly_charges      False
 total_charges        False
 churn                False
 dtype: bool]

In [68]:
df_excel_sample.is_senior_citizen.describe()

count    100.000000
mean       0.190000
std        0.394277
min        0.000000
25%        0.000000
50%        0.000000
75%        0.000000
max        1.000000
Name: is_senior_citizen, dtype: float64

In [69]:
df_excel_sample.phone_service.describe()

count    100.000000
mean       1.330000
std        0.667499
min        0.000000
25%        1.000000
50%        1.000000
75%        2.000000
max        2.000000
Name: phone_service, dtype: float64

In [70]:
df_excel_sample.internet_service.describe()

count    100.000000
mean       1.300000
std        0.771984
min        0.000000
25%        1.000000
50%        1.000000
75%        2.000000
max        2.000000
Name: internet_service, dtype: float64

In [71]:
df_excel_sample.contract_type.describe()

count    100.000000
mean       0.660000
std        0.819214
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        2.000000
Name: contract_type, dtype: float64

### 3. Read the data from this google sheet into a dataframe, df_google

In [74]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_googlesheet = pd.read_csv(csv_export_url)
df_googlesheet.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

- #### print the first 3 rows

- #### print the number of rows and columns

- #### print the column names

- #### print the data type of each column

- #### print the summary statistics for each of the numeric variables

- #### print the unique values for each of your categorical variables